Revit 2025 API
GBXMLExportOptions.GetMassZoneIds Method
 Gets a list of mass zones to analyze in the exported gbXML.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public IList<ElementId> GetMassZoneIds()
Public Function GetMassZoneIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetMassZoneIds()
member GetMassZoneIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The ids of the mass zones.
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace